/*********************************************************************
 * \file   MagMath.h
 * \brief  MagEngine数学ライブラリ統合ヘッダー
 *
 * \author Harukichimaru
 * \date   January 2025
 * \note
 *********************************************************************/
#pragma once

//========================================
// 数学定数と基本関数
#include "MathConstants.h"

//========================================
// 数学構造体
#include "MathStructures.h"

//========================================
// 描画系構造体
#include "GraphicsStructures.h"

//========================================
// アフィン行列
#include "AffineTransformations.h"

//========================================
// 4x4行列関数
#include "MathFunc4x4.h"

//========================================
// レンダリング行列
#include "RenderingMatrices.h"