/*********************************************************************
 * \file   EnemyManager.h
 * \brief  敵の一括管理管理クラス
 *
 * \author Harukichimaru
 * \date   January 2025
 * \note
 *********************************************************************/
#pragma once
#include "Enemy.h"

class EnemyManager {
	///--------------------------------------------------------------
	///							メンバ関数
public:
	/// \brief 初期化
	void Initialize();

	/// \brief 更新
	void Update();

	/// \brief 描画
	void Draw();

	///--------------------------------------------------------------
	///							静的メンバ関数
private:
	/// \brief 敵のスポーン処理(通常)
	void EnemySpawnNormal();

	///--------------------------------------------------------------
	///							入出力関数
public:
	///--------------------------------------------------------------
	///							メンバ変数
private:
};