/*********************************************************************
 * \file   EngineApp.cpp
 * \brief
 *
 * \author Harukichimaru
 * \date   January 2025
 * \note
 *********************************************************************/
#include "EngineApp.h"

///=============================================================================
///						初期化
void EngineApp::Initialize() {
	///--------------------------------------------------------------
	///						 フレームワーク初期化
	MagFramework ::Initialize();
}

///=============================================================================
///						終了処理
void EngineApp::Finalize() {
	CameraManager::GetInstance()->Finalize();///
	//========================================
	// フレームワークの終了処理
	MagFramework ::Finalize();
}

///=============================================================================
///						更新
void EngineApp::Update() {
	//========================================
	// 更新処理
	MagFramework ::Update();

	///--------------------------------------------------------------
	///						更新処理

	//========================================
	// ImGuiの更新
	MagFramework ::ImGuiPreDraw();
	//↓この間に書け!!!
	//↑
	MagFramework ::ImGuiPostDraw();
}

///=============================================================================
///						描画
void EngineApp::Draw() {
	//========================================
	// ループ前処理
	MagFramework ::FrameworkPreDraw();

	//========================================
	//3Dオブジェクト共通描画設定
	MagFramework ::Object3DCommonDraw();

	//========================================
	// 2Dオブジェクト共通描画設定
	MagFramework ::Object2DCommonDraw();

	//========================================
	//パーティクル共通描画設定
	MagFramework ::ParticleCommonDraw();

	//========================================
	// ループ後処理
	MagFramework ::FrameworkPostDraw();
}
