/*********************************************************************
 * \file   main.cpp
 * \brief  メインファイル
 *
 * \author Harukichimaru
 * \date   November 2024
 * \note
 *********************************************************************/
#include "EngineApp.h"
#include "MagFramework.h"
///=============================================================================
///						Windowsアプリでのエントリーポイント(main関数)
int WINAPI WinMain(HINSTANCE, HINSTANCE, LPSTR, int) {
	//========================================
	// フレームワークのインスタンスを生成
	MagFramework *framework = new EngineApp();
	//========================================
	// ゲームの実行
	framework->Run();
	//========================================
	// 終了
	delete framework;
	//========================================
	// プログラムの終了
	return 0;
}
