/*********************************************************************
 * \file   TestPlayer.h
 * \brief
 *
 * \author Harukichimaru
 * \date   May 2025
 * \note
 *********************************************************************/
#pragma once
#include "Vector2.h"

class TestPlayer {

	///--------------------------------------------------------------
	///							メンバ関数
public:
	/// \brief 初期化
	void Initialize();

	/// \brief 更新
	void Update();

	/// \brief 描画
	void Draw();

	///--------------------------------------------------------------
	///							静的メンバ関数
private:
	///--------------------------------------------------------------
	///							入出力関数
public:
	///--------------------------------------------------------------
	///							メンバ変数
private:
	Vector2 position_; // プレイヤーの位置
	Vector2 velocity_; // プレイヤーの速度
	Vector2 size_;	   // ボックスのサイズ
	float speed_;	   // 移動速度
};
