/*********************************************************************
* \file   GraphicsStructures.cpp
* \brief
*
* \author Harukichimaru
* \date   2025/10/16
* \note   none
*********************************************************************/
#pragma once
//========================================
// ライト
#include <Light.h>

//========================================
// マテリアル
#include <Material.h>
#include <MaterialData.h>

//========================================
// テクスチャ
#include <ModelData.h>

//========================================
// 頂点データ
#include <VertexData.h>