#pragma once
class GrayscaleEffect {

	///--------------------------------------------------------------
	///							メンバ関数
public:

	/// \brief 初期化
	void Initialize();

	/// \brief 更新
	void Update();

	/// \brief 描画 
	void Draw();

	///--------------------------------------------------------------
	///							静的メンバ関数
private:
	///--------------------------------------------------------------
	///							入出力関数
public:
	void CreatePipeline();


	void CreateRootSignature();

	///--------------------------------------------------------------
	///							メンバ変数
private:

};

